In [21]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import mysql.connector

In [45]:
cnx = mysql.connector.connect(user='root',
  password='newpassword',
  host='localhost',
  database='sql_hr')
cursor = cnx.cursor()

# Use the cursor to execute a SQL query
df = pd.read_sql("select * from employees", con=cnx)

cnx.close()
df.head()

C:\Users\ASUS\AppData\Local\Temp\ipykernel_14352\3695000469.py:8: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql("select * from employees", con=cnx)

,employee_id,first_name,last_name,job_title,salary,reports_to,office_id
0,33391,D'arcy,Nortunen,Account Executive,62871,37270.0,1
1,37270,Yovonnda,Magrannell,Executive Secretary,63996,NaN,10
2,37851,Sayer,Matterson,Statistician III,98926,37270.0,1
3,40448,Mindy,Crissil,Staff Scientist,94860,37270.0,1
4,56274,Keriann,Alloisi,VP Marketing,110150,37270.0,1

In [40]:
df.shape

(20, 7)

In [41]:
df.describe()

         employee_id         salary  reports_to  office_id
count      20.000000      20.000000        19.0  20.000000
mean    71003.150000   82502.350000     37270.0   3.250000
std     22105.773207   25100.063148         0.0   2.099499
min     33391.000000   32179.000000     37270.0   1.000000
25%     61465.500000   63714.750000     37270.0   2.000000
50%     72726.500000   89414.500000     37270.0   3.000000
75%     81707.000000   97306.750000     37270.0   4.000000
max    115357.000000  119241.000000     37270.0  10.000000

In [42]:
df.reset_index(drop=True, inplace=True)

In [44]:
df.head(2)

,employee_id,first_name,last_name,job_title,salary,reports_to,office_id
0,33391,D'arcy,Nortunen,Account Executive,62871,37270.0,1
1,37270,Yovonnda,Magrannell,Executive Secretary,63996,NaN,10

## Job title with highest number of salary

In [63]:
df.groupby('job_title')['salary'].max()

job_title
Account Executive               62871
Assistant Professor             32179
Computer Systems Analyst IV     96401
Cost Accountant                119241
Executive Secretary             63996
Financial Advisor               52832
Food Chemist                    47354
General Manager                 93760
Geologist II                    67987
Information Systems Manager     54578
Junior Executive                77182
Office Assistant I             117690
Pharmacist                      86119
Social Worker                   96767
Staff Accountant IV             70187
Staff Scientist                 94860
Statistician III                98926
Structural Engineer             92710
VP Marketing                   110150
VP Product Management          114257
Name: salary, dtype: int64

In [64]:
df.groupby('job_title')['salary'].max().idxmax()

'Cost Accountant'

In [62]:
df.loc[df['job_title']=='Cost Accountant']

,employee_id,first_name,last_name,job_title,salary,reports_to,office_id
12,76196,Mirilla,Janowski,Cost Accountant,119241,37270.0,3

In [70]:
## Another way

df.loc[df['salary'] == df['salary'].max(), 'job_title']

12    Cost Accountant
Name: job_title, dtype: object

In [81]:
# job title
df.loc[(df['job_title']=='Cost Accountant') | (df['job_title'] == 'Assistant Professor')]

,employee_id,first_name,last_name,job_title,salary,reports_to,office_id
5,63196,Alaster,Scutchin,Assistant Professor,32179,37270.0,2
12,76196,Mirilla,Janowski,Cost Accountant,119241,37270.0,3